<?php

use App\Domain\Regions\Models\Region;
use Illuminate\Database\Seeder;

class RegionsUpdateSeeder extends Seeder
{
    protected $geo = [];

    protected $data = [
        ['3', 'Андижанская область'],
        ['4', 'Бухарская область'],
        ['5', 'Ферганская область'],
        ['6', 'Джизакская область'],
        ['7', 'Республика Каракалпакстан'],
        ['8', 'Кашкадарьинская область'],
        ['9', 'Хорезмская область'],
        ['10', 'Наманганская область'],
        ['11', 'Навоийская область'],
        ['12', 'Самаркандская область'],
        ['13', 'Сырдарьинская область'],
        ['14', 'Сурхандарьинская область'],
        ['1', 'Ташкент'],
        ['2', 'Ташкентская область'],
    ];

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $this->geo = json_decode(file_get_contents((__DIR__) . '/resources/stanford-hv.json'), true);
        foreach ($this->data as $i => $datum) {
            $polygon = [];

            if (isset($this->geo['features'][$i]['geometry']['coordinates'][0][0])) {
                $pol00 = [];
                foreach ($this->geo['features'][$i]['geometry']['coordinates'][0][0] as $coordinate) {
                    $pol00[] = ['lat' => $coordinate[1], 'lng' => $coordinate[0]];
                }
                $polygon[] = $pol00;
            }
            if(isset($this->geo['features'][$i]['geometry']['coordinates'][0][1])) {
                $pol01 = [];
                foreach ($this->geo['features'][$i]['geometry']['coordinates'][0][1] as $coordinate) {
                    $pol01[] = ['lat' => $coordinate[1], 'lng' => $coordinate[0]];
                }
                $polygon[] = $pol01;
            }
            if(isset($this->geo['features'][$i]['geometry']['coordinates'][1][0])) {
                $pol10 = [];
                foreach ($this->geo['features'][$i]['geometry']['coordinates'][1][0] as $coordinate) {
                    $pol10[] = ['lat' => $coordinate[1], 'lng' => $coordinate[0]];
                }
                $polygon[] = $pol10;
            }
            if(isset($this->geo['features'][$i]['geometry']['coordinates'][2][0])) {
                $pol20 = [];
                foreach ($this->geo['features'][$i]['geometry']['coordinates'][2][0] as $coordinate) {
                    $pol20[] = ['lat' => $coordinate[1], 'lng' => $coordinate[0]];
                }
                $polygon[] = $pol20;
            }
            if(isset($this->geo['features'][$i]['geometry']['coordinates'][3][0])) {
                $pol30 = [];
                foreach ($this->geo['features'][$i]['geometry']['coordinates'][3][0] as $coordinate) {
                    $pol30[] = ['lat' => $coordinate[1], 'lng' => $coordinate[0]];
                }
                $polygon[] = $pol30;
            }


//            DB::table('regions')->insert([
//                [
//                    'title' => $datum['title'],
//                    'polygon' => json_encode($polygon),
//                ]
//            ]);

            $region = Region::find($datum[0]);
            if ($region) {
                $region->polygon = json_encode($polygon);
                $region->save();
            }

        }

        $region = Region::find(12);
        if ($region) {
            $region->polygon = '[[{"lat":39.7200368568317,"lng":65.06546565234376},{"lat":39.496002226491726,"lng":65.08743830859376},{"lat":39.28612567915633,"lng":66.02951594531251},{"lat":39.359030463277485,"lng":66.33919306933595},{"lat":39.33420621991618,"lng":66.57196589648439},{"lat":39.398571727969625,"lng":66.81847163378907},{"lat":39.25443025600871,"lng":66.90601893603517},{"lat":39.23757999960727,"lng":67.03219004809571},{"lat":39.305786909001796,"lng":67.17484065234376},{"lat":39.2862585438309,"lng":67.21775599658204},{"lat":39.27948212406279,"lng":67.29637690722657},{"lat":39.27695740791098,"lng":67.38735743701173},{"lat":39.30206764035767,"lng":67.40692683398439},{"lat":39.32145879814807,"lng":67.5229699248047},{"lat":39.466058519534016,"lng":67.45224543750001},{"lat":39.51762389753192,"lng":67.42276259600831},{"lat":39.54373972763594,"lng":67.49764987170411},{"lat":39.574774661991526,"lng":67.46340342700196},{"lat":39.64314803090088,"lng":67.45533534228517},{"lat":39.72267756292673,"lng":67.54082270800782},{"lat":39.783122056754834,"lng":67.43404933154298},{"lat":39.847731007244946,"lng":67.43988581835939},{"lat":39.95078157242373,"lng":67.37817355334474},{"lat":39.977950537957,"lng":67.18737193286134},{"lat":40.05328292879001,"lng":67.03648158251954},{"lat":40.18645536727794,"lng":66.9473034971924},{"lat":40.280188723275785,"lng":66.91370078265382},{"lat":40.35077151868883,"lng":66.822419845459},{"lat":40.49484878408565,"lng":66.78680010974122},{"lat":40.5343262260563,"lng":66.35567256152345},{"lat":40.49478351287501,"lng":65.9493500822754},{"lat":40.31184066737379,"lng":65.95218249499513},{"lat":40.182422678044034,"lng":65.95085211932374},{"lat":40.073498731155595,"lng":65.85130997836305},{"lat":40.12420067765103,"lng":65.70232936083985},{"lat":40.06438511929733,"lng":65.46208926379396},{"lat":40.044971525556114,"lng":65.30077048480226},{"lat":39.92031055064436,"lng":65.32072611987306},{"lat":39.86664070096803,"lng":65.20408221423341},{"lat":39.82713525907713,"lng":65.03589698016359},{"lat":39.7200368568317,"lng":65.06546565234376}]]';
            $region->save();
        }

        $region = Region::find(11);
        if ($region) {
            $region->polygon = '[[{"lat":39.913459299560614,"lng":64.42170100000001},{"lat":39.79538431037075,"lng":64.49585871484376},{"lat":39.717259070073624,"lng":64.85978083398439},{"lat":39.47387197147621,"lng":65.04242853906251},{"lat":39.605724635541584,"lng":65.15778498437501},{"lat":39.82175794348001,"lng":65.02045588281251},{"lat":39.90871913231833,"lng":65.20722346093751},{"lat":40.05143842541119,"lng":65.27588801171876},{"lat":40.11828877977252,"lng":65.91034846093751},{"lat":40.19944851865247,"lng":65.9374709584961},{"lat":40.32240494035687,"lng":65.9316344716797},{"lat":40.52590579341917,"lng":65.88700251367189},{"lat":40.504152560410766,"lng":66.25487284448243},{"lat":40.5663389051313,"lng":66.40859560754396},{"lat":40.53668599450825,"lng":66.57330469873048},{"lat":40.740501419608044,"lng":66.65836291101076},{"lat":40.951992287982776,"lng":66.52918772485353},{"lat":41.18451555952972,"lng":66.66780428674318},{"lat":41.65470488145659,"lng":66.57570795800783},{"lat":41.92135637362694,"lng":65.98429159906007},{"lat":42.92333186361722,"lng":66.07402758386232},{"lat":43.30469536940941,"lng":65.61444716241456},{"lat":43.73133191819397,"lng":64.97908549096681},{"lat":43.52622958690257,"lng":62.3167891958008},{"lat":41.76234446628598,"lng":61.763867900634786},{"lat":41.43032390376234,"lng":62.25368218209841},{"lat":41.492801201718656,"lng":62.56771521356203},{"lat":41.21726841859546,"lng":62.903720901275655},{"lat":40.94057005082261,"lng":63.19578127648928},{"lat":40.74599331568674,"lng":63.6910887220154},{"lat":40.817440068105306,"lng":64.32921843316652},{"lat":40.96107568879352,"lng":64.74990682389833},{"lat":40.822332926397635,"lng":64.90692333963014},{"lat":40.71073873765239,"lng":65.39673762109376},{"lat":40.34258974042412,"lng":65.10971979882814},{"lat":40.371171813522665,"lng":64.77326350000001},{"lat":39.913459299560614,"lng":64.42170100000001}]]';
            $region->save();
        }
    }
}
