<!DOCTYPE html>
<html>
<head>
    <title>Соглашение об использовании платформы и политика конфиденциальности CASVA</title>
    <style>
        * {
            -webkit-touch-callout: none; /* iOS Safari */
            -webkit-user-select: none; /* Safari */
            -khtml-user-select: none; /* Konqueror HTML */
            -moz-user-select: none; /* Firefox */
            -ms-user-select: none; /* Internet Explorer/Edge */
            user-select: none; /* Non-prefixed version, currently
            supported by Chrome and Opera */
            pointer-events: none;
            font-family:'Times New Roman', sans-serif;
            padding:0;
            margin:0;
            bos-sizing:border-box;
        }
        body{
            background-color:#cacaca;
            padding:0;
            margin:0;
            font-size: 14px;
            line-height: 1.7;
        }
        main{
            display:block;
            width:50%;
            max-width:1120px;
            min-height:100vh;
            background:#fff;
            margin:0 auto;
            padding:60px 150px;
            padding-bottom:120px;
        }
        li{
            list-style-type: none;
            display:block;
            padding-left:20px;
        }
        @media screen and (max-width:1200px) {
            main{
            display:block;
            width:100%;
            min-height:100vh;
            background:#fff;
            margin:0 auto;
            padding:35px 40px;
            box-sizing:border-box;
        }
        }
    </style>
</head>
<body>
    <main>
        <h4 style="text-align: center; font-size:22px;margin-bottom:50px">Публичная оферта и политика конфиденциальности</h4>
        <h3 style="text-align:center;">
        СОГЛАШЕНИЕ ОБ ИСПОЛЬЗОВАНИИ ОНЛАЙН ПЛАТФОРМЫ и ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ «www.casva.uz», CASVA
        <br />(ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ)</h3>
        <div>
            <h3>I. ТЕРМИНЫ, ИСПОЛЬЗУЕМЫЕ В НАСТОЯЩЕМ СОГЛАШЕНИИ</h3>
            <p>
                <b>1.1. Термины (определения понятий), приведенные в тексте настоящего соглашения используются в следующих значениях:</b><br />
                <b>Владелец платформы (Агрегатор) - ООО «Casva Software»,</b> зарегистрированное и действующее по законодательству Республики Узбекистан и определяющее основные условия пользования онлайн платформой.
            </p>
            <p>
                <b>Компания перевозчик- ООО «Сasva Freight»,</b> являющаяся ведущим перевозчиком платформы, которая на основании договора с перевозчиками, зарегистрированными на платформе, выступает в интересах заказчика.
            </p>
            <p>
            <b>Платформа</b> – сервис «CASVA на котором зарегистрировался пользователь: мобильные приложения и интернет сайт casva.uz. Платформа находится в собственности и управляется правообладателем - обществом с ограниченной ответственностью «Casva Software».
            </p>
            <p><b>Реквизиты: ООО «Casva Software»:</b></p>
            <p>
                Юридический адрес: Республика Узбекистан, Самаркандская область,<br />г.Самарканд, ул.Спитаменшох, д.270.<br />Наименование банка: «Асака» АКБ<br />Номер счета: 2020 8000 2053 5932 1001<br />МФО: 00264<br />ИНН: 308 289 464<br />Адрес электронной почты: info@casva.uz<br />Генеральный директор: Хамдамов М.Ф.</p>
            
            <div><p><b>Сайт</b> - онлайн-сервис, веб-сайт грузоперевозок и транспортно-экспедиторских услуг, идентифицируемый в сети Интернет с помощью доменного имени: «<a href="https://.casva.uz">www.casva.uz</a>»  через который заказчик размещает заказ, и сайт <a href="https://merchant.casva.uz">merchant.casva.uz</a> - для перевозчиков и всех его поддоменнов, название которых содержит основной домен: «<a href="https://casva.uz">www.casva.uz</a>».</p>
<br /><p><b>Мобильное приложение</b> - мобильные приложения на базе IOS и Android: «<b>Casva</b>» (для заказчиков) и «<b>Casva Driver</b>» (для перевозчиков) - сервис грузоперевозок и логистических услуг, правообладателем которого является владелец платформы.</p>
<p><b>Заказчик</b> (грузоотправитель, грузовладелец)- зарегистрированный пользователь платформы, принявший условия настоящего соглашения, имеющий намерение перевезти принадлежащий ему на законных основаниях груз и произвести оплату за услуги на условиях настоящего соглашения и договора на оказание услуг грузоперевозки, размещенного на платформе его владельцем, заключенного посредством платформы.<br /><br /></p>
<p><b>Перевозчик</b> - зарегистрированный пользователь платформы, принявший условия настоящего соглашения, имеющий возможность перевезти вверенный заказчиком (грузовладельцем, грузоотправителем) груз в пункт назначения и выдать груз непосредственно заказчику или управомоченному им на их получение лицу, получить оплату за перевозку и оплатить вознаграждение владельцу платформы (агрегатору) через Компанию перевозчика- ООО «Сasva Freight».</p>
<p><b>Пользователь</b> (заказчик, грузовладелец, грузоотправитель, перевозчик) - родовое понятие, охватывающее собой любого посетителя платформы, находящегося на любой из его страниц.</p>
<p><b>Пользователями</b> платформы признаются: граждане Республики Узбекистан, иностранные граждане, лица без гражданства (физические лица), юридические лица и общественные объединения, имеющие право в соответствии с законодательством Республики Узбекистан, быть пользователями в порядке, установленном законодательством Республики Узбекистан, общедоступных интернет-ресурсов, веб-сайтов и т. д., функционирующих на территории Республики Узбекистан.</p>
<p><b>Заказ</b> с предложением о перевозке груза - конкретные данные о грузе, условиях его перевозки (дате, времени, объеме и т. д.) оставленные заказчиком с использованием интерфейса платформы с целью получения услуги перевозки.</p>
<p><b>Регистрация</b> - заполнение специальной формы на платформе, влекущее за собой принятие дополнительных условий, не указанных в настоящем соглашении, в зависимости от целей использования платформы.</p>
<p><b>Зарегистрированный пользователь</b> - пользователь, прошедший регистрацию на платформе, которым может выступать как физическое, так и юридическое лицо.</p>
<p><b>Сделка</b> - подтверждение заказчиком ценового предложения на перевозку по своему запросу (нажатием кнопки «Разместить заказ») с обязательством оплатить за перевозку.</p>
<p><b>Аккаунт пользователя</b> - его личный кабинет, зарегистрированный на платформе, где зарегистрированный пользователь может управлять своими заказами.</p>
<p><b>Логин</b> – имя пользователя платформы, используемый для идентификации пользователей при использовании платформы, в частности при общении, заключении договоров и другом взаимодействии пользователей, осуществляемом с использованием интерфейса платформы.</p>
<br />
<h3>II. ОБЩИЕ СВЕДЕНИЯ О ПЛАТФОРМЕ И УСЛОВИЯХ, НА КОТОРЫХ ОНА ФУНКЦИОНИРУЕТ</h3>
<ul>
    <li>2.1. Настоящее Соглашение - является публичной офертой. То есть каждый пользователь, использующий настоящую платформу или использующий его отдельные функции (сервисы), материалы (информацию) на нем размещенные, автоматически считается присоединившимся к настоящему соглашению.</li>
    <li>2.2. Платформа представляет собой онлайн-сервис грузоперевозок и транспортно-логистических услуг, представляющий возможность грузовладельцам (заказчикам) оставлять запросы на доставку или перевозку любых частных и (или) коммерческих грузов, а перевозчикам предлагать свои услуги по доставке (перевозке) грузов.</li>
    <li>2.3. Заказчик вправе выбрать или отказаться от предложенной перевозчиком цены или условий перевозки (доставки) груза, на условиях заключенного договора на оказание услуг грузоперевозки, размещенного на платформе его владельцем и заключенного посредством платформы с перевозчиком до его заключения или на условиях, указанных в договоре в случае его заключения.</li>
    <li>2.4. При использовании платформы каждый пользователь должен в обязательном порядке ознакомиться с нижеследующей информацией и учитывать ее при пользовании платформой.</li>
    <li>2.5. Владелец платформы может менять условия настоящего соглашения в любое время, внося изменения в данный документ, размещенный на настоящей платформе.</li>
    <li>2.6. Пользователям необходимо самостоятельно отслеживать изменения настоящего соглашения и иных документов, определяющих правовую основу функционирования платформы. В случае, если пользователь не согласен с изменениями, внесенными в настоящее соглашение (новая редакция соглашения), то он обязан немедленно отказаться от пользования платформой, прекратить любое использование материалов (информации) и функций (сервисов) платформы.</li>
    <li>2.7. Посещение настоящей платформы, использование его сервисов (функций), информации, на нем размещенной, регулируется настоящим соглашением, а также действующими нормами законодательства Республики Узбекистан (применимое право).</li>
</ul>
<h3>III. ОБЩИЕ УСЛОВИЯ СОГЛАШЕНИЯ. ЗАВЕРЕНИЯ И ГАРАНТИИ</h3>
<p>Общие пределы ответственности владельца платформы</p>
<ul>
    <li>3.1. Владелец платформы стремится обеспечить пользователям доступ к платформе круглосуточно. Между тем, в случаях, когда пользователь не может получить доступ к платформе или её отдельным функциям (сервисам) по каким-либо причинам как зависящим от контроля владельца платформы, так и независимых от контроля владельца платформы, то владелец платформы не несет ответственность за убытки (реальный ущерб, упущенная выгода), которые, по мнению пользователя платформы, возникли на его стороне из-за непредставления владельцем платформы доступа к нему или его отдельным функциям (сервисам).</li>
    <li>3.2. Доступ к платформе может быть временно закрыт без предварительного уведомления в случае профилактических работ на сервере, непредвиденной технической ошибки или по каким-либо причинам как зависящим, так и независящим от контроля владельца платформы.</li>
    <li>3.3. Однако владелец платформы настоящим гарантирует, что он будет предпринимать все зависящие от него меры по возобновлению использования платформы его пользователями.</li>
    <li><br><b>Ответственность владельца платформы в отношении содержания платформы (информации на ней размещенной)</b><br></li>
    <li>3.4. Владелец платформы стремится гарантировать, что вся информация, размещенная на платформе, является достоверной. Вместе с тем, владелец платформы не несет ответственность за точность и полноту информации, размещенной (предоставленной) на платформе пользователями самостоятельно.</li>
    <li>3.5. Настоящим владелец платформы заявляет, что он может вносить изменения в материалы и записи на платформе без предварительного уведомления. Владелец платформы также не исключает, что некоторая информация на платформе может быть устаревшей, поэтому не делает никаких обязательств по обновлению таких материалов.</li>
    <li>3.6. Содержимое платформы представляется как «есть», в связи с чем владелец платформы не предоставляет никаких гарантий в отношении информации оставленной пользователями на платформе самостоятельно.</li>
    <li><b>3.7. Владелец платформы, кроме ответственности, прямо предусмотренной настоящим соглашением или иным любым соглашением, размещенным владельцем платформы на настоящей платформе, но, не ограничиваясь указанным ниже, не несет ответственность: за любые прямые (реальный ущерб) или косвенные убытки (упущенная выгода) или ущерб, понесенный любым пользователем платформы в связи с недоступностью платформы или в связи использованием любых материалов (информации) на платформе, в том числе, но не ограничиваясь:</b></li>
    <ul>
        <li style="list-style-type:circle!important;">- за потерю доходов;</li>
        <li style="list-style-type:circle!important;">- за потерю контракта или сделки;</li>
        <li style="list-style-type:circle!important;">- за потерю ожидаемых сбережений;</li>
        <li style="list-style-type:circle!important;">- за потерю данных по вине пользователя.</li>
    </ul>
</ul>
<p><b>Общие положения об обязательствах и ответственности пользователя</b></p>
<ul>
    <li>3.8. Настоящим пользователь соглашается с тем, что в ходе использования настоящей платформы, материалов (информации), на нем размещенных, не будет совершать действий, ведущих к нарушению норм действующего законодательства Республики Узбекистан или норм международного права, ратифицированных Республикой Узбекистан в установленном законом порядке, но, не ограничиваясь приведенными, нормами о защите интеллектуальной собственности и средств индивидуализации юридических лиц, товаров, работ, услуг и предприятий.</li>
    <li>3.9. Пользователю запрещается публиковать на платформе информацию (материалы) которые:</li>
    <ul>
        <li>- могут быть расценены как уголовное преступление, приводят к гражданско-правовой ответственности или нарушает права других пользователей и (или) любых третьих лиц в любой стране мира;</li>
        <li>- могут быть технически вредными, включая компьютерные вирусы, «логические бомбы» и другие вредоносные компоненты;</li>
        <li>- позволяют собирать и хранить персональные данные других пользователей платформы или любых других третьих лиц;</li>
        <li>- вводят других пользователей настоящей платформы и других любых третьих лиц в заблуждение, в том числе путем выдачи себя (пользователя) за другое лицо и/или представителя организации, государственного органа, органа местного самоуправления и/или сообщества, объединения граждан, в том числе за владельца платформы или его официального представителя;</li>
        <li>- если он противоречит иным любым образом законодательству Республики Узбекистан и нормам международного права.</li>
    </ul>
    <li>3.10. Пользователь настоящей платформы не вправе копировать (воспроизводить), перерабатывать, распространять, отображать, опубликовывать, передавать, и иным способом использовать целиком или по частям, материалы (информацию) других пользователей платформы как без предварительного согласия владельца платформы, так правообладателя материалов (другого пользователя), за исключением случаев, когда правообладатель (другой пользователь) явным образом выразил свое согласие на свободное использование материалов (информации).</li>
    <li>3.11. Настоящее соглашение не может быть истолковано как дающее пользователю (или иному другому третьему лицу) права использовать (ссылаться) в маркетинговых, рекламных или любых других печатных, электронных материалах на название, логотипы и/или товарные знаки или авторские права владельца платформы без их письменного предварительного согласия владельца.</li>
    <li>3.12. Настоящим пользователь платформы также соглашается с тем, что в случае получения владельцем платформы претензий других пользователей или иных других третьих лиц (правообладателей) о нарушении пользователем прав на использование материалов (информации), размещенных на платформе, а также о нарушении иных других прав других пользователей или третьих лиц, то пользователь обязуется самостоятельно и за свой счет урегулировать указанные претензии.</li>
    <li>3.13. По требованию любого уполномоченного на то органа государственной власти или суда Республики Узбекистан владельцем платформы будет раскрыта любая персональная, конфиденциальная или личная информация, оставленная на платформе пользователем платформы.</li>
    <li><br /><b>Заверения и гарантии владельца платформы</b><br /></li>
    <li>3.14. Авторские и другие права интеллектуальной собственности на все материалы платформы (включая, без ограничений, все фотографии и графические изображения), самостоятельно размещенные владельцем платформы на платформе, принадлежат ему.</li>
    <li>3.15. Никакая часть платформы не может быть воспроизведена, скопирована или храниться на другом платформе без предварительного письменного разрешения владельца платформы.</li>
    <li><br><b>Правомочия владельца платформы</b><br></li>
    <li><b>3.16. Владелец платформы может по своему усмотрению ограничить доступ к платформе или отказаться от переписки с любым пользователем платформы без предварительного уведомления, если:</b></li>
    <li>
        <ul>
            <li>есть нормативные, то есть предусмотренные законом (законами) Республики Узбекистан изменения, ограничивающие возможности владельца платформы для предоставления доступа к платформе;</li>
            <li>есть какие-либо события вне контроля владельца платформы, препятствующие доступу к платформе (например, технические неполадки).</li>
        </ul>
    </li>
    <li>3.17. Доступ к платформе может быть ограничен владельцем платформы и в иных случаях по его усмотрению, если действия пользователя платформы, по мнению владельца платформы, нарушают действующее законодательство Республики Узбекистан, международные нормативные акты или противоречат нормам этики и (или) морали; владелец платформы посчитает, что пользователь платформы злоупотребляет свои правами на платформе или ведет иную деятельность, противоречащую любым пунктам данного соглашения.</li>
    <li><br><b>Ссылки «на» и «с» других платформ</b><br></li>
    <li>3.18. Ссылки на платформы третьих лиц приводятся исключительно для удобства пользователя платформы. Если пользователь платформы переходит по этим ссылкам, то пользователь платформы покидает настоящую платформу и владелец платформы не несет никакой ответственности за информацию и содержание материалов на платформе третьих лиц.</li>
    <li><br><b>3.19. Пользователям разрешено размещать ссылки на настоящую платформу только если:</b><br></li>
    <li>
        <ul>
            <li>- не изменяется и не искажается логотип и название настоящей платформы;</li>
            <li>- не размещается недостоверная, ложная информация о сервисе и платформе;</li>
            <li>- размещение ссылки на настоящую платформу не является подтверждением того, что мы поддерживаем тот или иной сайт или продукт;</li>
            <li>- размещение ссылки не влечет за собой умысел на хищение или копирование какой-либо интеллектуальной собственности, принадлежащей ООО «CASVA Software», и объектов авторского права, вне зависимости от того, зарегистрированы они в установленном законом порядке или нет.</li>
        </ul>
    </li>
    <li>3.20. Владелец платформы оставляет за собой право аннулировать ссылку на палатформу в случае нарушения лицом, разместившим ссылку, условий настоящего соглашения или если владелец платформы посчитает, что совершаются действия, которые владелец платформы считает не уместными, не корректными, противоречащими нормам действующего законодательства.</li>
    <li>3.21. Пользователь, разместивший ссылку или владелец ресурса, на котором она была размещена, должен полностью компенсировать любые потери или ущерб, который мог быть нанесен владельцу платформы в ходе нарушений условии настоящего соглашения.</li>
</ul><br />
<h3>Защита домена</h3>
<ul>
    <li>3.22. Пользователи платформы обязуются не регистрировать доменное имя, которое включает слово «CASVA» в случаях, если услуги, предоставляемые интернет-ресурсом, расположенным по такому адресу являются смежными с услугами, предоставляемыми на настоящей платформе.</li>
    <li><br><b>Другие условия</b><br></li>
    <li>3.23. Платформа создана на территории Республики Узбекистан и функционирует в соответствии с законодательством Республики Узбекистан, предназначен для пользователей, указанных в настоящем соглашении. Вне зависимости от места нахождения пользователя платформы, обязательства, принятые на себя пользователями настоящей платформы, использование и функционирование платформы осуществляется в соответствии с действующим законодательством Республики Узбекистан.</li>
    <li>3.24. Политика конфиденциальности является неотъемлемой частью настоящего соглашения. Пользователь платформы, согласившийся с условиями настоящего соглашения, автоматически выражает свое согласие на соблюдение условий политики конфиденциальности.</li>
</ul>
<br>
<h3>IV ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h3>
<b>Регистрация</b>
<ul>
    <li>4.1. Только зарегистрированные пользователи платформы могут с помощью его сервисов совершать сделки, направленные на перевозку соответствующих грузов. Регистрация на платформе закрыта для лиц младше 14 лет.</li>
    <li>4.2. Лица в возрасте от 14 до 18 лет, совершая сделки или принимая на себя иные гражданско-правовые обязательства с помощью настоящей платформы должны руководствоваться (соблюдать) положения статьи 27 Гражданского кодекса Республики Узбекистан (далее - ГК РУз).</li>
    <li>4.3. Владелец платформы не несет никакой ответственности за совершение лицами в возрасте от 14 до 18 лет действий с нарушением требований статьи 27 ГК РУз.</li>
    <li>4.4. Поскольку пользование платформой не предполагает совершение мелких бытовых сделок, сделок по безвозмездному получению выгоды, по распоряжению средствами, предоставленными законным представителем или с согласия последнего третьим лицом для определенной цели или для свободного распоряжения, то регистрация на платформе закрыта для лиц в возрасте до 14 лет. Сделки от указанных лиц с использованием сервисов (функций) платформы в соответствии статьи 27 ГК РУз могут совершать от их имени только их родители, усыновители или опекуны.</li>
    <li>4.5. Если пользователь регистрируется в качестве юридического лица, то тем самым он заявляет, что у него есть права представлять данное лицо, то есть зарегистрировавшийся пользователь является уполномоченным работником юридического лица, его представителем по доверенности.</li>
    <li>4.6. Регистрационные данные являются действительными только для одного пользователя. Запрещено передавать свой профиль и регистрационные данные (логин и пароль) другому пользователю, если только пользователи не действуете в рамках одного юридического лица.</li>
    <li>4.7. Пользователь берет на себя всю ответственность за все действия, совершенные им на платформе, а также за безопасность своего пароля к профилю.</li>
    <li>4.8. При регистрации пользователь обязуется предоставлять достоверную и по необходимости полную персональную информацию, а также соглашается с условиями настоящего пользовательского соглашения. Регистрация от имени другого лица недопустима.</li>
    <li>4.9. Повторная регистрация пользователя запрещена. При обнаружении случаев повторной регистрации, учетные записи могут быть заблокированы. Исключение составляют случаи регистрации одного и того же лица в качестве заказчика (грузовладельца) и перевозчика.</li>
</ul>
<br>
<h3>При регистрации в качестве заказчика пользователь обязан подтвердить один из следующих параметров:</h3>
<p>
    <ul>
        <li>- E-mail (опционально);</li>
        <li>- номер мобильного телефона (обязательно)</li>
        <li><br><b>4.10. При регистрации в качестве перевозчика пользователь обязан подтвердить следующие параметры:</b></li>
        <li>- фамилию, имя, отчество (далее - ФИО), указанную при регистрации в качестве физического лица, и водительского удостоверение;</li>
        <li>- мобильный номер телефона, получив специальный код по смс-сообщению от сервиса «CASVA»;</li>
        <li>- если регистрация происходит на индивидуального предпринимателя (далее - ИП) или Юридическое лицо, пользователь обязан загрузить свидетельство о регистрации в качестве ИП или Юридического лица;</li>
        <li>- указать адрес местонахождения Юридического лица или ИП;</li>
        <li>- подтвердить наличие водительских прав и технического паспорта транспортного средства;</li>
        указать пароль для своей будущей учетной записи на сервисе «CASVA» (юридическому лицу).
    </ul>
    <br>
    <ul>
        <li>4.11. При невыполнении условий регистрации администрация сервиса (владелец платформы) вправе отказать в регистрации или заблокировать уже существующий аккаунт без предупреждения и объяснения причин.</li>
        <li><br><b>Сделки, совершенные с использованием настоящей платформы, его сервисов (функций), но с нарушением настоящего соглашения, действующего законодательства Республики Узбекистан (незаконные сделки)</b></li>
        <li>
            4.12. Незаконными сделками признаются следующие:
            <ul>
                <li>- совершенные с нарушением настоящего соглашения и (или) норм действующего законодательства Республики Узбекистан, международного законодательства;</li>
                <li>- так или иначе, связанные с осуществлением незаконной деятельности согласно законам Республики Узбекистан и (или) нормам международного законодательства;</li>
                <li>- не связанные с грузоперевозками любых категорий.</li>
            </ul>
        </li>
    </ul>
    <br>
    <h3>Контактная информация</h3>
    <ul>
        <li><b>4.13. Для обеспечения одинаково равных условий для всех участников торгов, контактную информацию (телефоны, адреса электронной почты и др.) можно указывать только в личном кабинете пользователя в специально отведенных для этого полях:</b></li>
        <li>
            <ul>
                <li>Имя - Фамилия Имя и Отчество;</li>
                <li>Телефон - Номер мобильного телефона, который будет служить для связи;</li>
                <li>E-Mail адрес - Адрес электронной почты.</li>
            </ul>
        </li>
    </ul>
    <br>
    <ul>
        <b>Платные услуги</b>
        <li>4.14. Для Заказчика (грузовладельца) сервис является полностью бесплатным.</li>
        <li>4.15. Для Перевозчика услуги платные, согласно отдельно заключенным договорам. Перевозчик оплачивает вознаграждение Владельцу платформы через Компанию-перевозчика.</li>
        <li><br><b>Особые условия соглашения</b></li>
        <li>4.16. Настоящим перевозчик заявляет и гарантирует, что для выполнения своих обязательств по перевозке груза использует свой собственный персонал, с которым он заключил либо трудовой договор, либо договор гражданско-правового характера, и который имеет все необходимые лицензии, разрешения на работу, допуски и иные разрешительные документы, предусмотренные действующим законодательством Республики Узбекистан.</li>
        <li>4.17. Перевозчик имеет права для исполнения обязательств по перевозке грузов привлечь третьих лиц, за действия которых несет ответственность, как за свои собственные. Весь персонал третьих лиц должен соответствовать условиям, указанным в пункте 4.26 настоящего соглашения.</li>
        <li>4.18. Перевозчик обязуется в порядке, предусмотренном законодательством Республики Узбекистан, получать согласие от собственного персонала о передаче их персональных данных владельцу платформы, в том числе в целях выполнения обязательств по настоящему соглашению и соглашению по перевозке груза.</li>
        <li><br><b>Антикоррупционная оговорка</b></li>
        <li>4.19. При исполнении своих обязательств по настоящему соглашению или соглашению о перевозке груза, и иным соглашениям (договорам) заключаемых через платформу, стороны (заказчик (грузовладелец), перевозчик), их аффилированные лица, работники или посредники обязуются не осуществлять действия, квалифицируемые, как дача/получение взятки, коммерческий подкуп, а также действия, нарушающие требования законодательства Республики Узбекистан и международных актов о противодействии легализации (отмыванию) доходов, полученных преступным путем и финансирование терроризма.</li>
    </ul>
</p>
<br />
<br />

<div id="privacyDrivers">
    <p><b>Использование местоположения:</b>

    <p>Местоположение Пользователя (в данном случае Водителя) используется для предоставления наилучшего обслуживания Клиентам и Водителям, поскольку оно обеспечивает отслеживание товаров в режиме реального времени, когда это необходимо. Фактически, Пользователь может в любое время удалить разрешение, если он того пожелает.</p>
    <p>Только после разрешения Пользователя данные о местоположении получаются, когда приложение:</p>
    <ul>
        <li>- Работеат на переднем плане;</li>
        <li>- Работеат на заднем плане;</li>
        <li>- И когда не запущено.</li>
        <li><br /><b>Пользователь может разрешить или запретить использование местоположения!</b></li>
    </ul>
</div>

</div>


</div>
</main>

</body>
</html>