<?php

return [
    'sms_time_out' => 'Вы сможете переотправить смс через :seconds секунд',
    'sms_code_wrong' => 'Неверный код подтверждения. Возможно код устарел. Попробейте переотправить sms.',
    'sms_code_wrong_error' => 'Неверный код подтверждения',
    'sms_no_code_error' => 'Поле Код подтверждения обязательно для заполнения.',
    'invalid_data' => 'Введенные данные неверны',
    'user_blocked' => 'Пользователь заблокирован',
    'user_access_forbidden' => 'Досутуп запрещен',
    'user_has_not_car' => 'Нет авто.',
    'booking_accepted' => 'Заявка принята другим водителем',
    'booking_cancelled' => 'Заявка отклонена клиентом',
    'incorrect_data' => 'Неверный логин и/или пароль',
    'merchant_user' => 'Нельзя авторизоваться как Мерчант'
];
